print("Возняк Софія ІС-01")
print("Умова: Скільки розв'язків має система рівнянь, задана коефіцієнтами a1, b1, a2, b2 і правими частинами с1, с2")
print(" ")
print("Введіть коефіцієнти а1, b1, c1 для першого рівняння через пробіл: ")   

a1, b1, c1 = input().split()
a1 = float(a1)
b1 = float(b1)
c1 = float(c1)
print("Введіть коефіцієнти а2, b2, c2 для другого рівняння через пробіл: ") 
a2, b2, c2 = input().split()
a2 = float(a2)
b2 = float(b2)
c2 = float(c2)

if a1/a2 == b1/b2 == c1/c2:
    print("Система має безліч коренів.")
elif a1/a2 != b1/b2:
    print("Система має один розв'язок.")
else:
    print("Система не має розвязків.")


